/* $ObjectName=MAFLogonManagerNG_iOS */
/* $Collection=frwk.tools.ios */
/* $Domain=BC */
/* $Developer=I043975 */
/* $Description=Mobile Application Framework - iOS Reusable Tool Components */

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidParameter" = "Parâmetro inválido.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "Código de operação inválido.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "Impossível conectar ao servidor. Verifique os dados de início de sessão.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "Usuário já conectado.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "Execução da operação já em andamento.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "Contexto de operação inválido.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "ID inválido para protocolo de comunicação.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "ID do item de ação inválido.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "Não foi possível determinar protocolo de comunicação.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "Verifique sua senha.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "Esse dispositivo já foi registrado para outro usuário.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "Os códigos inseridos não coincidem.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "Operação não permitida nesse estado.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "Os dados de início de sessão inseridos são insuficientes ou inválidos. Tente novamente.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "Não foi possível reiniciarlizar o app. Verifique se está conectado à rede.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckLoginData" = "Impossível conectar ao servidor. Verifique os dados de início de sessão.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "Verifique seu nome de usuário e senha.";

/* XMSG */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "Impossível conectar ao servidor. Entre em contato com o administrador.";

/* XMSG */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "Os dados de início de sessão inseridos são insuficientes ou inválidos. Tente novamente.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "Inserir o código correto.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "Inserir um código que contenha ao menos um dígito.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "Os códigos inseridos não coincidem.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "O código expirou. É necessário modificá-lo.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLength" = "Inserir um código que contenha ao menos {0} caracteres.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "Inserir um código que contenha ao menos uma letra minúscula.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "Inserir um código que contenha ao menos um caractere especial.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "Inserir um código que contenha ao menos {0} caracteres únicos.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "Inserir um código que contenha ao menos uma letra maiúscula.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "Não foi possível chamar chave para certificado.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "Não foi possível chamar certificado.";

/* XMSG */
"keyErrDescrMAFLogonErrorAppSettingsValidation" = "Application Setting property validation failed for key:";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "Erro desconhecido";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "Memória segura já existe";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "Erro de tipo de dados";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "Memória segura não existe";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "Argumento inválido";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "Inserir o código correto.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "A memória segura está bloqueada";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "Memória segura está com capacidade esgotada";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "O código expirou. É necessário modificá-lo.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "Inserir um código que contenha ao menos {0} caracteres únicos.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "Inserir um código que contenha ao menos um dígito.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "Inserir um código que contenha ao menos uma letra minúscula.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "Inserir um código que contenha ao menos um caractere especial.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "Inserir um código que contenha ao menos uma letra maiúscula.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "Inserir um código que contenha ao menos {0} caracteres.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "Inserir um código que contenha ao menos {0} caracteres únicos.";

/* XMSG */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "Memória segura já eliminada.";

/* XMSG */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "Operação não suportada.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "Código SSO inválido.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "Credenciais Afaria inválidas.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorClientIdentityNotFound" = "Identificação do cliente não encontrada";

/* XMSG: message */
"keyErrDescrMAFLogonErrorURLValidationFailed" = "Acesso negado";

/* XMSG: message */
"keyErrDescrMAFLogonErrorXMLParserInitializationError" = "Cannot instantiate the xml parser.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorXMLParserError" = "Error during xml parsing.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorSettingsDownloadFailed" = "Settings download failed.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorHTTPDomainError" = "HTTP domain error with response status:";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidJSONData" = "JSON data is invalid";

/* XMSG: message */
"keyErrDescrMAFLogonErrorJSONParserError" = "Error during json parsing";

